# Tap homebrew
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/boneyard'
tap 'homebrew/dev-tools'
tap 'homebrew/bundle'
tap 'homebrew/services'

# Browsers
cask 'firefox'
cask 'firefox-developer-edition'
cask 'google-chrome'

# Terminals
cask 'iterm2'
brew 'okg-config', link: true
brew 'tmux'
cask 'ngrok'

# Shells
brew 'bash'
brew 'bash-completion'

# Editors
brew 'vim'
cask 'atom'

# Downloaders
brew 'curl', link: true
brew 'wget'

# VCS
brew 'git'
brew 'git-lfs'

# DBs
brew 'postgres'
brew 'pgcli'
brew 'redis', restart_service: true
brew 'sqlite', link: true

# Languages
brew 'ruby'
brew 'rbenv'
brew 'elixir'
brew 'lua'
brew 'luarocks'
brew 'node'
brew 'python'
brew 'python3'
brew 'rust'
brew 'gcc'

# Encryption
brew 'bcrypt'
brew 'scrypt'

# Everything else
brew 'fzf'
brew 'ag'
brew 'unzip'
brew 'bzip2', link: true
brew 'gzip'
brew 'zstd'
brew 'rsync'
brew 'syncthing'

cask 'calibre'
brew 'imagemagick'
